fioLogs_clh_always/fio-128k-read.log
file1: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
...
fio-3.1
Starting 8 processes

file1: (groupid=0, jobs=1): err= 0: pid=71: Tue Feb 18 11:38:49 2020
   read: IOPS=132, BW=16.6MiB/s (17.4MB/s)(14.6GiB/900002msec)
    slat (usec): min=14, max=488519, avg=7511.30, stdev=20958.02
    clat (usec): min=16, max=2111.3k, avg=112768.25, stdev=209556.18
     lat (usec): min=946, max=2266.4k, avg=120281.09, stdev=222762.46
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   19], 20.00th=[   27],
     | 30.00th=[   33], 40.00th=[   40], 50.00th=[   47], 60.00th=[   52],
     | 70.00th=[   60], 80.00th=[   85], 90.00th=[  288], 95.00th=[  567],
     | 99.00th=[ 1116], 99.50th=[ 1284], 99.90th=[ 1552], 99.95th=[ 1653],
     | 99.99th=[ 1989]
   bw (  KiB/s): min=  247, max=139030, per=12.45%, avg=16974.95, stdev=20453.78, samples=1798
   iops        : min=    1, max= 1086, avg=132.08, stdev=159.79, samples=1798
  lat (usec)   : 20=0.01%, 1000=0.01%
  lat (msec)   : 2=0.36%, 4=0.29%, 10=2.70%, 20=7.47%, 50=47.79%
  lat (msec)   : 100=23.01%, 250=7.38%, 500=5.13%, 750=2.77%, 1000=1.56%
  lat (msec)   : 2000=1.52%, >=2000=0.01%
  cpu          : usr=0.08%, sys=9.39%, ctx=416767, majf=0, minf=49097
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=119621,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=72: Tue Feb 18 11:38:49 2020
   read: IOPS=132, BW=16.6MiB/s (17.4MB/s)(14.6GiB/900004msec)
    slat (usec): min=13, max=513139, avg=7518.96, stdev=21103.81
    clat (usec): min=16, max=2057.4k, avg=112859.13, stdev=207829.66
     lat (usec): min=961, max=2109.9k, avg=120381.03, stdev=220975.20
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   20], 20.00th=[   28],
     | 30.00th=[   34], 40.00th=[   40], 50.00th=[   47], 60.00th=[   52],
     | 70.00th=[   61], 80.00th=[   85], 90.00th=[  292], 95.00th=[  567],
     | 99.00th=[ 1116], 99.50th=[ 1250], 99.90th=[ 1502], 99.95th=[ 1636],
     | 99.99th=[ 1787]
   bw (  KiB/s): min=  248, max=144896, per=12.42%, avg=16938.15, stdev=20315.26, samples=1797
   iops        : min=    1, max= 1132, avg=131.93, stdev=158.94, samples=1797
  lat (usec)   : 20=0.01%, 1000=0.01%
  lat (msec)   : 2=0.34%, 4=0.31%, 10=2.73%, 20=7.15%, 50=47.74%
  lat (msec)   : 100=23.53%, 250=7.10%, 500=5.16%, 750=2.88%, 1000=1.53%
  lat (msec)   : 2000=1.52%, >=2000=0.01%
  cpu          : usr=0.08%, sys=9.06%, ctx=415580, majf=0, minf=49097
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=119526,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=73: Tue Feb 18 11:38:49 2020
   read: IOPS=133, BW=16.7MiB/s (17.5MB/s)(14.7GiB/900003msec)
    slat (usec): min=14, max=515667, avg=7486.19, stdev=20980.12
    clat (usec): min=16, max=2057.7k, avg=112407.37, stdev=207597.58
     lat (usec): min=1012, max=2083.3k, avg=119896.15, stdev=220693.46
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   20], 20.00th=[   27],
     | 30.00th=[   33], 40.00th=[   40], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   60], 80.00th=[   85], 90.00th=[  288], 95.00th=[  558],
     | 99.00th=[ 1099], 99.50th=[ 1250], 99.90th=[ 1536], 99.95th=[ 1636],
     | 99.99th=[ 1804]
   bw (  KiB/s): min=  247, max=135182, per=12.49%, avg=17037.97, stdev=20517.50, samples=1798
   iops        : min=    1, max= 1056, avg=132.55, stdev=160.24, samples=1798
  lat (usec)   : 20=0.01%, 1000=0.01%
  lat (msec)   : 2=0.37%, 4=0.26%, 10=2.77%, 20=7.21%, 50=48.35%
  lat (msec)   : 100=22.76%, 250=7.41%, 500=4.98%, 750=2.79%, 1000=1.61%
  lat (msec)   : 2000=1.48%, >=2000=0.01%
  cpu          : usr=0.09%, sys=9.37%, ctx=414027, majf=0, minf=49097
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=120022,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=74: Tue Feb 18 11:38:49 2020
   read: IOPS=132, BW=16.6MiB/s (17.4MB/s)(14.6GiB/900002msec)
    slat (usec): min=14, max=495317, avg=7522.69, stdev=21024.17
    clat (usec): min=38, max=2158.0k, avg=112919.66, stdev=209219.08
     lat (usec): min=864, max=2293.8k, avg=120444.06, stdev=222452.82
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   20], 20.00th=[   28],
     | 30.00th=[   34], 40.00th=[   41], 50.00th=[   47], 60.00th=[   52],
     | 70.00th=[   61], 80.00th=[   83], 90.00th=[  292], 95.00th=[  567],
     | 99.00th=[ 1116], 99.50th=[ 1267], 99.90th=[ 1536], 99.95th=[ 1636],
     | 99.99th=[ 1938]
   bw (  KiB/s): min=  440, max=148480, per=12.42%, avg=16937.43, stdev=20454.74, samples=1797
   iops        : min=    3, max= 1160, avg=131.90, stdev=159.99, samples=1797
  lat (usec)   : 50=0.01%, 1000=0.02%
  lat (msec)   : 2=0.42%, 4=0.27%, 10=2.64%, 20=7.17%, 50=47.64%
  lat (msec)   : 100=23.79%, 250=7.03%, 500=5.10%, 750=2.79%, 1000=1.61%
  lat (msec)   : 2000=1.52%, >=2000=0.01%
  cpu          : usr=0.08%, sys=9.16%, ctx=413219, majf=0, minf=49099
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=119461,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=75: Tue Feb 18 11:38:49 2020
   read: IOPS=133, BW=16.7MiB/s (17.5MB/s)(14.6GiB/900001msec)
    slat (usec): min=12, max=524996, avg=7488.51, stdev=21006.54
    clat (usec): min=2, max=2045.9k, avg=112469.67, stdev=208955.99
     lat (usec): min=434, max=2122.2k, avg=119963.28, stdev=222167.37
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   19], 20.00th=[   27],
     | 30.00th=[   33], 40.00th=[   40], 50.00th=[   46], 60.00th=[   51],
     | 70.00th=[   60], 80.00th=[   84], 90.00th=[  292], 95.00th=[  567],
     | 99.00th=[ 1099], 99.50th=[ 1284], 99.90th=[ 1552], 99.95th=[ 1636],
     | 99.99th=[ 1804]
   bw (  KiB/s): min=  248, max=146468, per=12.48%, avg=17021.70, stdev=20623.27, samples=1797
   iops        : min=    1, max= 1144, avg=132.48, stdev=161.17, samples=1797
  lat (usec)   : 4=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.39%, 4=0.27%, 10=2.87%, 20=7.28%, 50=48.28%
  lat (msec)   : 100=22.71%, 250=7.23%, 500=5.07%, 750=2.73%, 1000=1.72%
  lat (msec)   : 2000=1.44%, >=2000=0.01%
  cpu          : usr=0.09%, sys=8.83%, ctx=411712, majf=0, minf=49077
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=119932,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=76: Tue Feb 18 11:38:49 2020
   read: IOPS=134, BW=16.8MiB/s (17.6MB/s)(14.7GiB/900004msec)
    slat (usec): min=13, max=516505, avg=7442.81, stdev=20940.80
    clat (usec): min=15, max=2035.4k, avg=111732.84, stdev=206176.90
     lat (usec): min=814, max=2135.9k, avg=119179.27, stdev=219187.03
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   19], 20.00th=[   27],
     | 30.00th=[   33], 40.00th=[   40], 50.00th=[   46], 60.00th=[   51],
     | 70.00th=[   59], 80.00th=[   85], 90.00th=[  279], 95.00th=[  567],
     | 99.00th=[ 1099], 99.50th=[ 1234], 99.90th=[ 1502], 99.95th=[ 1620],
     | 99.99th=[ 1821]
   bw (  KiB/s): min=  256, max=141824, per=12.55%, avg=17121.56, stdev=20564.85, samples=1797
   iops        : min=    2, max= 1108, avg=133.30, stdev=160.78, samples=1797
  lat (usec)   : 20=0.01%, 750=0.01%, 1000=0.04%
  lat (msec)   : 2=0.41%, 4=0.26%, 10=2.67%, 20=7.38%, 50=48.42%
  lat (msec)   : 100=22.60%, 250=7.43%, 500=4.89%, 750=2.85%, 1000=1.62%
  lat (msec)   : 2000=1.44%, >=2000=0.01%
  cpu          : usr=0.08%, sys=9.01%, ctx=416808, majf=0, minf=49097
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=120705,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=77: Tue Feb 18 11:38:49 2020
   read: IOPS=133, BW=16.6MiB/s (17.5MB/s)(14.6GiB/900004msec)
    slat (usec): min=8, max=491354, avg=7490.88, stdev=20885.84
    clat (usec): min=2, max=2203.6k, avg=112574.00, stdev=207291.25
     lat (usec): min=717, max=2355.2k, avg=120069.84, stdev=220362.78
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   20], 20.00th=[   28],
     | 30.00th=[   33], 40.00th=[   40], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   61], 80.00th=[   86], 90.00th=[  296], 95.00th=[  558],
     | 99.00th=[ 1099], 99.50th=[ 1250], 99.90th=[ 1552], 99.95th=[ 1703],
     | 99.99th=[ 1888]
   bw (  KiB/s): min=  254, max=147456, per=12.44%, avg=16960.90, stdev=20479.69, samples=1798
   iops        : min=    1, max= 1152, avg=132.11, stdev=160.22, samples=1798
  lat (usec)   : 4=0.01%, 750=0.01%, 1000=0.03%
  lat (msec)   : 2=0.33%, 4=0.30%, 10=2.83%, 20=7.00%, 50=48.34%
  lat (msec)   : 100=22.81%, 250=7.26%, 500=5.20%, 750=2.83%, 1000=1.59%
  lat (msec)   : 2000=1.46%, >=2000=0.01%
  cpu          : usr=0.09%, sys=9.00%, ctx=414637, majf=0, minf=49106
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=119849,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=78: Tue Feb 18 11:38:49 2020
   read: IOPS=133, BW=16.6MiB/s (17.5MB/s)(14.6GiB/900001msec)
    slat (usec): min=14, max=511040, avg=7499.00, stdev=21075.68
    clat (nsec): min=1732, max=2132.5M, avg=112560602.83, stdev=209279805.56
     lat (usec): min=138, max=2201.6k, avg=120064.28, stdev=222551.67
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   14], 10.00th=[   19], 20.00th=[   27],
     | 30.00th=[   33], 40.00th=[   40], 50.00th=[   46], 60.00th=[   51],
     | 70.00th=[   60], 80.00th=[   87], 90.00th=[  284], 95.00th=[  567],
     | 99.00th=[ 1099], 99.50th=[ 1284], 99.90th=[ 1552], 99.95th=[ 1703],
     | 99.99th=[ 1972]
   bw (  KiB/s): min=  436, max=139008, per=12.46%, avg=16994.31, stdev=20486.61, samples=1796
   iops        : min=    3, max= 1086, avg=132.36, stdev=160.24, samples=1796
  lat (usec)   : 2=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.41%, 4=0.35%, 10=2.89%, 20=7.18%, 50=48.23%
  lat (msec)   : 100=22.50%, 250=7.50%, 500=5.10%, 750=2.70%, 1000=1.65%
  lat (msec)   : 2000=1.47%, >=2000=0.01%
  cpu          : usr=0.09%, sys=8.99%, ctx=413354, majf=0, minf=49105
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=119826,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=133MiB/s (140MB/s), 16.6MiB/s-16.8MiB/s (17.4MB/s-17.6MB/s), io=117GiB (126GB), run=900001-900004msec